app/views/all/index.html.erb

SELECT "contacts".* FROM "contacts"
SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 2]]
SELECT SUM("contacts"."contact_num") AS sum_id FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 2]]
---
      	<td><%= city.name %></td>
        <td><%= city.contacts.count %></td>
        <td><%= city.contacts.sum(:contact_num) %></td>