app/views/contacts/_form.html.erb

    <%= f.label :city_id %><br>
    <%= f.select :city_id, City.all.map { |p| [p.name, p.id_city]} %>&nbsp&nbsp<%= link_to 'New Contact', new_city_path %>
---
SELECT "cities".* FROM "cities"