app/controllers/all_controller.rb

	def index
# @cont = Contact.all

	@cities = City.joins(:contacts).group(Contact.arel_table[:city_id]).order(Contact.arel_table[:city_id].count).reverse
@cities = Kaminari.paginate_array(@cities).page(params[:page]).per(10)
---
SELECT "cities".* FROM "cities" INNER JOIN "contacts" ON "contacts"."city_id" = "cities"."id" GROUP BY "contacts"."city_id"  ORDER BY COUNT("contacts"."city_id")
SELECT "cities".* FROM "cities"
SELECT "contacts".* FROM "contacts"
SELECT COUNT(*) FROM "contacts"  WHERE "contacts"."city_id" = ?  [["city_id", 2]]