app/controllers/cities_controller.rb

  def create
    @city = City.new(city_params)
      if @city.save
---
INSERT INTO "cities" ("created_at", "id_city", "name", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2014-07-29 19:27:06.957110"], ["id_city", 1], ["name", "Rzeszów"], ["updated_at", "2014-07-29 19:27:06.957110"]]