app/controllers/contacts_controller.rb

  def create
    @contact = Contact.new(contact_params)
    if @contact.save
---
INSERT INTO "contacts" ("city_id", "contact_num", "created_at", "date", "updated_at") VALUES (?, ?, ?, ?, ?)  [["city_id", 1], ["contact_num", 64], ["created_at", "2014-08-02 14:12:50.802172"], ["date", "2014-08-02"], ["updated_at", "2014-08-02 14:12:50.802172"]]